{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_15","layers":[{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense21","trainable":true,"batch_input_shape":[null,34],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout14","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense22","trainable":true}}]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null,"weightData":"","weightSpecs":[{"name":"dense21/kernel","shape":[34,1024],"dtype":"float32"},{"name":"dense21/bias","shape":[1024],"dtype":"float32"},{"name":"dense22/kernel","shape":[1024,2],"dtype":"float32"}],"weightsManifest":[{"paths":["./weight.bin"],"weights":[{"name":"dense21/kernel","shape":[34,1024],"dtype":"float32"},{"name":"dense21/bias","shape":[1024],"dtype":"float32"},{"name":"dense22/kernel","shape":[1024,2],"dtype":"float32"}]}]}